app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("title", "due_date", "description", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "una lista"], ["due_date", "2017-11-30"], ["description", "hola"], ["done", "f"], ["created_at", "2017-11-30 13:29:51.976341"], ["updated_at", "2017-11-30 13:29:51.976341"]]