app/controllers/tasks_controller.rb

  def index
    @tasks = Task.where("due_date >= ?",Date.today).where(user_id: current_user.id)
---
SELECT "tasks".* FROM "tasks" WHERE (due_date >= '2017-12-02') AND "tasks"."user_id" = ?  [["user_id", 1]]

  def create
    @task = Task.new(task_params)
    @task.user_id=current_user.id
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "due_date", "description", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "lavar los platossa"], ["due_date", "2017-12-01"], ["description", "wewew"], ["done", "f"], ["created_at", "2017-12-01 03:25:06.051662"], ["updated_at", "2017-12-01 03:25:06.051662"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Estudiar para el final de concurrente"], ["updated_at", "2017-12-02 02:52:08.216817"], ["id", 2]]